УчетВУправляющихДляГит1/src/Enums/УПЖКХ_ПараметрыБлоковСведенийУниверсальнойВыгрузкиДанных/УПЖКХ_ПараметрыБлоковСведенийУниверсальнойВыгрузкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УПЖКХ_ПараметрыБлоковСведенийУниверсальнойВыгрузкиДанных</name>
  <enumValues>
    <name>ЗаводскойНомер</name>
  </enumValues>
  <enumValues>
    <name>Идентификатор</name>
  </enumValues>
  <enumValues>
    <name>Код</name>
  </enumValues>
  <enumValues>
    <name>Наименование</name>
  </enumValues>
  <enumValues>
    <name>НомерСчетчикаВГИСЖКХ</name>
  </enumValues>
  <enumValues>
    <name>Показание</name>
  </enumValues>
  <enumValues>
    <name>ПустоеПоле</name>
  </enumValues>
  <enumValues>
    <name>СуммаДолга</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/УПЖКХ_ПараметрыБлоковСведенийУниверсальнойВыгрузкиДанных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область МетодыМенеджераПеречисления

// Возвращает список параметров блока сведений по типу блока.
//
// Параметры:
//  ТипБлока - Строка	 - "Счетчики" или "Услуги".
// 
// Возвращаемое значение:
//  СписокЗначений - список параметров блока сведений.
//
Функция СписокПараметровБлокаСведений(ТипБлока) Экспорт
	
	СписокПараметров = Новый СписокЗначений;
	
	Если ТипБлока = "Услуги" Тогда
		
		СписокПараметров.Добавить(Код,          Код);
		СписокПараметров.Добавить(Наименование, Наименование);
		СписокПараметров.Добавить(СуммаДолга,   СуммаДолга);
		
	ИначеЕсли ТипБлока = "Счетчики" Тогда
		
		СписокПараметров.Добавить(Код,                  Код);
		СписокПараметров.Добавить(Наименование,         Наименование);
		СписокПараметров.Добавить(ЗаводскойНомер,       ЗаводскойНомер);
		СписокПараметров.Добавить(Идентификатор,        Идентификатор);
		СписокПараметров.Добавить(НомерСчетчикаВГИСЖКХ, НомерСчетчикаВГИСЖКХ);
		СписокПараметров.Добавить(Показание,            Показание);
		
	КонецЕсли;
	
	СписокПараметров.Добавить(ПустоеПоле, ПустоеПоле);
	
	Возврат СписокПараметров;
	
КонецФункции

#КонецОбласти

#КонецЕсли
